app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `body`, `published_at`, `created_at`, `updated_at`, `excerpt`, `location`) VALUES ('', '', '2022-01-30 10:14:00', '2022-01-30 10:14:13.837912', '2022-01-30 10:14:13.837912', '', '')
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save